Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཤིན་ཏུ་མཉམ་པར་གཞག་པས་བརྒྱད་བསྒྲིལ་དུ་བཀལ་ཏེ།
en: Then he should take the separate threads and, fully focused, twist them together into a string of eight strands. “

source: དོན་ཡོད་རྒྱལ་པོ་ཐལ་མོ་སྦྱར་བས་པདྨ་ཁ་ཕྱེ་བ་ཐོགས་པ་རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བཞུགས་པ།
en: He should prepare an effigy of the upper body of Amogharāja with his hands joined in the añjali gesture and holding a blossoming lotus.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་པའི་ལུས་ཕྱེད་པ་སོར་བཞི་བའི་ཚད་བགྱིའོ།
en: The figure should be four fingers in height, crowned with a diadem upon his topknot, and adorned with all ornaments.

source: །བགྱིས་ནས་གཟུགས་རྣམ་པ་གསུམ་དུ་བགྱིས་ཏེ། ངེས་པའི་གཟུགས་དང་། ཁྲོ་གཉེར་གྱི་བཞིན་དང་། ཁྲོ་བོའི་རྒྱལ་པོའི་གཟུགས་ཏེ། དངུལ་ལམ་གསེར་ལས་བགྱིའོ།
en: The vidyā holder should use silver or gold to make three forms of the effigy—one peaceful, one frowning, and one in the form of Krodharāja.

source: །དེ་ནས་ཞགས་པ་སྲིད་ཀྱི་ཚད་ཁྲུ་བཅུ་དྲུག་པ་ཞགས་པའི་ཐོར་ཏོ་གཅིག་རྡོ་རྗེ་རྩེ་གསུམ་པ་དང་།
en: He should attach a noose that is sixteen cubits long to one side of the effigy, and a trident with a myrobalan fruit to the other side. “

source: སྐྱུ་རུ་ར་ལྷན་ཅིག་སྦྲེལ་བ་གདགས་པར་བགྱིའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཡར་གྱི་ངོའི་ཚེས་བཅྭ་ལྔའམ་ཚེས་བརྒྱད་ལ་ལེགས་པར་བཀྲུས་ཏེ་གོས་གཙང་མ་བགོས་ནས་ཞག་གཅིག་མཆིས་ཏེ།
en: Then, on the fifteenth day, the day of the full moon, or on the eighth, the vidyā holder should fast for one day and one night and then bathe and put on clean clothes.

source: སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་སངས་རྒྱས་ལ་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བགྱིས་ཏེ།
en: Sitting cross-legged, he should worship the Buddha with offerings as prescribed.

source: ཚིག་གཞན་མི་སྨྲ་བར་ཞགས་པ་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ། །དེ་ནས་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་།
en: Without uttering other words, he should incant the noose with the mantra one thousand and eight times.

source: སྟན་བཟང་པོ་བཤམས་ནས། དེའི་སྟེང་དུ་ཞགས་པ་གཞག་པར་བགྱིའོ། །དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱས་དབང་བསྐུར་བར་བགྱིའོ། །མེ་ཏོག་དང་། བདུག་པ་དང་།
en: When the number of recitations is complete, he should arrange a divine seat, place the noose on it, and consecrate it with the mudrā of Amoghapāśa.

source: དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། བ་དན་བཟང་པོ་ལ་སོགས་པས་མཆོད་པར་བགྱིའོ།
en: He should perform a pūjā fit for the gods, offering flowers, incense, fragrances, garlands, unguents, scented powders, cloth, and so forth.

source: །ཨ་ག་རུ་དང་། ཙན་དན་དང་། དུ་རུ་སྐའི་བདུག་པ་དབུལ་བར་བགྱིའོ། །མར་མེ་ཡང་དབུལ་བར་བགྱིའོ།
en: He should burn incense of agarwood, sandalwood, and olibanum and light lamps. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ། ཞགས་པའི་སྟེང་དུ་གཏོར་བར་བགྱིའོ། །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་ཡང་ཅི་འབྱོར་པས་མཆོད་པར་བགྱིའོ།
en: He should then incant mustard seeds twenty-one times and cast them upon the noose, and he should worship a cotton painting of Avalokiteśvara with whatever offerings are available.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཞགས་པ་དེའི་མདུན་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ། མ་འཁྲུགས་པས་གདུགས་རྩེའི་བར་དུ་མཆོད་པ་བགྱིས་ནས་བཟླས་བརྗོད་བགྱིའོ།
en: Sitting cross-legged and undistracted in front of the noose, he should perform worship in the morning and then recite the mantra.

source: །ཡུངས་ཀར་རེ་རེ་ལ་བཟླས་བརྗོད་རེ་རེ་བགྱིས་ཏེ། ཞགས་པའི་སྟེང་དུ་གཏོར་ཞིང་སྟོང་རྩ་བརྒྱད་ཚང་གི་བར་དུ་གདུགས་རེ་རེ་མཆིས་པར་བགྱི་སྟེ།
en: Incanting the mustard seeds just once, he should throw them on the noose one thousand and eight times.

source: རྡོ་ཅི་ཐོགས་པས་གདུགས་རྩེའི་བར་དུ་བཟླས་བརྗོད་བགྱིའོ། །མཆོད་པ་བགྱིའོ།
en: He should do this every day as much as he can, reciting the mantra in the morning and performing worship.

source: །ཁ་ཟས་ངན་པ་སྤང་བར་བགྱིའོ། །ལྷག་མ་དང་སྤགས་པ་སྤང་བར་བགྱིའོ། །གོས་གཙང་མ་བགོ་བར་བགྱིའོ།
en: He should avoid spoiled or leftover food and wear clean clothes. “

source: །སྟོང་རྩ་བརྒྱད་ཚང་ནས་ཞགས་པ་འབར་བར་འགྱུར་ཏེ།
en: When the vidyā holder has reached the number one thousand and eight, the noose will blaze with light.

source: གལ་ཏེ་འཇིག་རྟེན་པའི་གྲུབ་ན་ནི་མེའི་ཁ་དོག་ཏུ་འབར་བར་འགྱུར་རོ། །གལ་ཏེ་འཇིག་རྟེན་ལས་འདས་པའི་གྲུབ་ན་ནི། ཁ་དོག་སྣ་ཚོགས་འབར་བར་འགྱུར་རོ།
en: If the accomplishment that he has won is worldly, the noose will blaze with the light of a fire; if the accomplishment is supramundane, the noose will blaze with multicolored light.

source: །དོན་ཡོད་པའི་ལུས་དེ་ཡང་འབར་བར་འགྱུར་རོ། །སྒྲ་འབྱུང་བར་འགྱུར་ཏེ།
en: The body of Amoghapāśa will likewise emit light, and he will utter the following words: ‘Good!

source: རིག་སྔགས་འཆང་ལེགས་སོ་ལེགས་སོ།
en: Good it is, O vidyā holder!

source: །ཁྱོད་ཀྱིས་འཇིག་རྟེན་ལས་འདས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཞགས་པ་འདི་གྲུབ་ཀྱིས།
en: You have attained a supramundane accomplishment.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སེམས་བླ་ན་མེད་པ་ཁུག་ཅིག །
en: With the noose of bodhicitta, you have drawn to yourself the supreme bodhicitta.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུའི་ཁོངས་སུ་གཏོགས་པ་ཡོངས་སུ་རྫོགས་པར་གྱིས་ཤིག །
en: You have fully developed the six perfections and are endowed with the ten perfections.’ “

source: འོན་ཏེ་འཇིག་རྟེན་པའི་སྒྲུབ་ན་ནི་ཡིད་བཞིན་གྱི་ནོར་བུས་བསམས་པ་ཅི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: From then on, the wishes of the vidyā holder will be fulfilled, and his worldly practice will become like a wish-fulfilling jewel.

source: །ཅི་ལྟར་ཡིད་ལ་བསམས་ཤིང་སྨོན་པ་བཞིན་ལག་པས་འཕངས་ན་གསང་སྔགས་ཀྱིས་ཐམས་ཅད་འགྲུབ་པར་བགྱིད་དེ།
en: Any requests he may have will be realized as soon as he flings his hand.

source: ཐམས་ཅད་བཀུག་པར་འགྱུར་རོ།
en: Everything desirable will be drawn to him.

source: །ཕྱོགས་གང་དང་གང་དུ་འཕངས་པ་དེ་ལོགས་སུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བདུན་བཟླས་པར་བགྱིས་ཏེ། མོད་ལ་བསམས་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: If he casts the noose in any direction while reciting the heart mantra of Amoghapāśa seven times, anything he wants from that direction will instantly be brought to him.

source: །གལ་ཏེ་མཚམས་མེད་པ་ལྔ་བགྱིས་པའམ་མནར་མེད་པར་མཆི་བ་ཞིག་ན་ཡང་དེའི་ལེགས་པར་འགྲུབ་པར་འགྱུར་ཏེ།
en: Even if he has committed the five acts of immediate retribution and is destined to be reborn in the Avīci hell, this practice will effectively nullify it.

source: དེ་ལ་ཡིད་གཉིས་དང་། སོམ་ཉི་བསྐྱེད་པར་མི་བགྱིའོ། །ཁྲོ་གཉེར་གྱི་བཞིན་གྱིས་གང་དུ་འཕངས་ན། ལྷ་དང་།
en: There should be no doubt or uncertainty in this regard. “

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་རྣམས་བཀུག་ནས། རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆི་བར་འགྱུར་ཞིང་།
en: Wherever the vidyā holder casts the noose attached to the frowning effigy, all devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and other nonhuman and human beings will certainly be pulled before the vidyā holder and will remain his servants for as long as he lives.

source: ཅི་སྲིད་འཚོའི་བར་དུ་བྲན་བཞིན་དུ་མཆིས་པར་འགྱུར་རོ། །རྒྱལ་པོ་དང་བློན་པོ་དང་། བཙུན་མོའི་འཁོར་ཐམས་ཅད་མཆིས་པར་འགྱུར་རོ། །འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཆེར་མཆོད་པར་འགྱུར་རོ།
en: All the kings and royal ministers with their harems and retinues will remain in his thrall, and he will be much venerated by the entire world.

source: །གང་གི་དོན་དུ་ཞགས་པ་འཕངས་པའི་དོན་དེ་འགྲུབ་པར་འགྱུར། །ཁྲོ་བོའི་རྒྱལ་པོའི་ཞགས་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས་འཕང་བར་བགྱིའོ། །འཕངས་པ་ཙམ་གྱི་མོད་ལ་བགེགས་དང་ལོག་འདྲེན་དང་།
en: Whatever his purpose for casting the noose, that purpose will be realized. “

source: གདུག་པའི་སེམས་ཅན་ཐམས་ཅད་ཞགས་པས་བཅིངས་པར་འགྱུར་རོ། །གལ་ཏེ་འཚལ་ན་ལོའམ། ལོ་བརྒྱའམ། ལོ་སྟོང་ངམ། བསྐལ་པ་བརྒྱ་སྟོང་གི་བར་དུ་ཞགས་པས་བཅིངས་པར་འགྱུར་རོ།
en: If the vidyā holder incants the Krodharāja twenty-one times and casts the noose attached to him, then, as soon as it is cast, all the vighnas, vināyakas, and other wicked beings will be bound by the noose and will remain so, according to the vidyā holder’s wish, for a year, a hundred years, a thousand years, or a hundred thousand eons.

source: །ནམ་བྱམས་པ་དང་། སྙིང་རྗེ་བསྐྱེད་ནས། དེའི་ཚེ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་གསུམ་བཟླས་ན་ཕྱིར་བཀྲོལ་བར་འགྱུར་རོ།
en: When he feels pity and love for them, he should recite the heart mantra of Amoghapāśa three times to free them.

source: །དཔུང་གི་ནང་དུ་འཕངས་ན་དཔུང་རྣམས་ཞགས་པས་བཅིངས་པར་འགྱུར་རོ། །གཡུལ་འགྱེད་པའི་དབུས་སུ་འཕངས་ན་མཚོན་ཆ་དང་། གོ་མཚོན་དང་། གཞུ་དང་། མདའ་དང་། མདུང་དང་། རལ་གྲི་དང་། གཏུན་ཤིང་དང་། མུ་སིན་དི་དང་། འཁོར་ལོ་དང་། ཐག་མདུང་དང་། མཚོན་ཆ་ཐམས་ཅད་དང་། གོ་ཆ་དང་།
en: If he casts the noose of Krodharāja into the thick of a battle, all weapons and arms, such as bows, arrows, spears, swords, clubs, musuṇḍis, discuses, lances, shields, and armor, will be bound by the noose.

source: ཡ་ལད་ཐམས་ཅད་ཞགས་པས་བཅིངས་པར་འགྱུར་རོ། །ཆབ་དང་ཡུངས་ཀར་ལ་ལ་ན་བདུན་བཟླས་བརྗོད་བགྱིས་ཏེ། གཏེར་ན་གྲོལ་བར་འགྱུར་རོ།
en: He can free them by casting onto the, water and mustard seeds incanted seven times.

source: །ཞགས་པ་ལ་གདུགས་གཅིག་བཞིན་ཅི་འབྱོར་པས་མཆོད་པར་བགྱིའོ། །གང་གི་དོན་དུ་བསམས་པ་དེ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: He should make offerings to the noose every day according to his means, to succeed in whatever venture he undertakes.

source: །དོན་ཡོད་པའི་ཞགས་པ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This ritual procedure to be thus performed is called the unfailing noose. “

source: འོན་ཏེ་མི་སྣང་བ་བསྒྲུབ་པར་འཚལ་ན་དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་ལག་པས་བཅིངས་ཏེ།
en: If the vidyā holder wants to become invisible, he should do as follows.

source: གཡས་པ་དང་གཡོན་པས་གང་དུ་ཇི་སྐད་གསུངས་པ་བཞིན་ཞགས་པ་བཟུང་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ན་མི་གདའ་བར་འགྱུར་རོ།
en: He should form his right and left hands into the mudrā of Amoghapāśa as previously described. He should then hold the noose and recite the heart mantra of Amoghapāśa one hundred and eight times.

source: །བརྒྱ་རྩ་བརྒྱད་ལན་གཉིས་བཟླས་བརྗོད་བགྱིས་ན་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་རོ། །དོན་ཡོད་པའི་རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་བརྒྱ་སྟོང་ཕྲག་འབུམ་གྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: If he recites the mantra one hundred and eight times twice, he will be able to travel through space and will become the great emperor of the unfailing noosevidyādharas with a retinue of one hundred thousand million.

source: །ལོ་བྱེ་བ་བཅུར་འཚོ་བར་འགྱུར་རོ།
en: He will live one hundred million years.

source: །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་འགྱུར་རོ། །སྟོབས་དང་། བརྩོན་འགྲུས་ཕ་རོལ་གྱིས་ཟིལ་གྱིས་མི་གནོན་པར་འགྱུར་རོ།
en: His hair will become wavy and curly, and his strength, energy, and valor can never be impaired. “

source: །ཆར་པ་འཚལ་བས་མཆོད་པ་བགྱིས་ན་ཅི་ཙམ་གསོལ་བ་བཏབ་པ་བཞིན་འབབ་པར་འགྱུར་རོ།
en: If there is need for rain, the vidyā holder can perform the appropriate pūjā, and it will rain as much as necessary.

source: །ཧ་ཅང་ཆར་པ་ཆེས་པ་དགག་པའི་སླད་དུ་མཆོད་པ་བགྱིས་ན་ཆར་པ་བཀག་པར་འགྱུར་རོ། །ཡམས་ཀྱི་ནད་དང་།
en: If it rains too much, he can perform the pūjā for stopping the rain, and the rain will stop.

source: གནོད་པ་དང་། འཚེ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་དང་། མི་ངས་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འཚལ་བས་རིག་སྔགས་འཆང་ལེགས་པར་ཁྲུས་བགྱིས་པ་གཙང་མས་གོས་གཙང་མ་བགོས་ལ་ལག་པས་ཞགས་པ་བླངས་ཏེ།
en: If there is need to pacify any misfortune, disasters, calamities, or deadly pestilences, the vidyā holder should bathe, clean himself, and put on clean clothes.

source: གནས་མཐོན་པོར་འཛེགས་ནས་དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་དང་།
en: He should climb to an elevated spot with the noose in his hand and hold the noose while displaying the mudrā of Amoghapāśa.

source: ཞགས་པ་བཅིངས་ནས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཕྱོགས་བཞིར་ལན་བདུན་བཟླས་ནས་ཞགས་པ་འཕངས་ན་དེ་དག་ཐམས་ཅད་དྲན་པ་ཙམ་གྱིས་འཐབ་པ་དང་། རྩོད་པ་དང་།
en: He should recite the heart mantra of Amoghapāśa seven times into each of the four directions while casting the noose.

source: འགྱེད་པ་དང་། རང་གི་དཔུང་དང་། གཞན་གྱི་དཔུང་ཐམས་ཅད་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་དང་། མི་མཛའ་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: As soon as the mantra is recited, all quarrels, disagreements, disputes, and lawsuits will cease, and armies, whether one’s own or those of the enemy, and all opponents and adversaries will be appeased.

source: །འཇིགས་པ་དང་། ཡམས་ཀྱི་ནད་དང་། གནོད་པ་ཐམས་ཅད་དང་། མི་ངས་ཆེན་པོ་དང་མུ་གེའི་དགོན་པའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །ཧ་ཅང་ཆར་ཆེ་བ་དང་།
en: All fears, hostilities, misfortunes, deadly pestilences, famines, and other dangers will be pacified.

source: དུས་མ་ལགས་པའི་ཆར་དང་། གྲང་བ་དང་། རླུང་དང་། ཚ་བ་མི་བཟད་པའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །དཔག་ཚད་བརྒྱ་སྟོང་ཁོར་ཡུག་ཏུ་མཚམས་ཆེན་པོ་བཅིང་བ་བགྱིས་པར་འགྱུར་རོ།
en: Excessive or untimely rains, cold spells, strong winds, heat waves, and all similar dangers will not arise, and a protective boundary will be created with the radius of one hundred leagues.

source: །ཅི་ལྟ་ཅི་ལྟར་ཡིད་ལ་བསམས་པ་དེ་ལྟ་དེ་ལྟར་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་བས།
en: The vidyā holder will accomplish whatever wishes come to his mind. “

source: དོན་ཡོད་རྒྱལ་པོ་མཆོད་པར་བགྱི་ཞིང་བཟླས་བརྗོད་བགྱི་གསོལ་བར་ཡང་བགྱིའོ།
en: He should perform a pūjā, recite the Amogharāja, and pay homage to him.

source: །མཆོད་པ་དང་། གསོལ་བ་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཏེ།
en: By merely performing the pūjā and making the requests, everything will instantly turn out favorably.

source: དེ་ལ་ཡིད་གཉིས་དང་སོམ་ཉི་བསྐྱེད་པར་མི་བགྱིའོ།
en: He should not question or have any doubts about this.

source: །ཆོ་ག་ཞིབ་མོ་ལས་ཅི་སྐད་གསུངས་པ་བཞིན་ལས་བགྱིད་པ་རྣམས་ཀྱིས་ཆོ་ག་དེ་བཞིན་དུ་བསྒྲུབ་པར་བགྱིའོ། །དེ་ནས་སྐད་ཅིག་དེའི་མོད་ལ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: He should perform any of the ritual activities that have been taught in this manual, any of the procedures and practices, and so obtain instant success in everything. “

source: །བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་བསྒོམ་པར་བགྱིའོ།
en: He should cultivate loving kindness, compassion, sympathetic joy, and equanimity.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་མཆོག་ཏུ་བརྩེ་བར་བགྱིའོ།
en: He should be wholly motivated by pity for all sentient beings.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པར་བགྱིའོ། །དཀོན་མཆོག་གསུམ་ལ་གུས་པར་བགྱིའོ།
en: He should worship Noble Avalokiteśvara and feel respect for the Three Jewels.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་གུས་པ་དང་། བླ་མར་ཡིད་ལ་བསྒོམ་པར་བགྱིའོ།
en: He should contemplate all the tathāgatas and respect his master.

source: །མི་གཙང་བ་སྤྱོད་པ་གཙང་བར་བགྱི་ཞིང་ཡོངས་སུ་དག་པའི་ངང་ཚུལ་ཅན་དུ་བསྒོམ་པར་བགྱིའོ།
en: He should maintain pure conduct and have pure morality.

source: །དོན་ཡོད་པའི་ཞགས་པ་དེ་ཁོ་ན་ཉིད་ཀྱི་ཆོ་ག་སྒྲུབ་པ་ཡིད་བཞིན་གྱི་ནོར་བུ་བྱང་ཆུབ་དགུག་པར་བགྱིའོ།
en: By its very nature, the prescribed practice of Amoghapāśa, whereby one attracts the principle of bodhi, is like a wish-fulfilling jewel. “

source: །དེ་ནས་ཞགས་པའི་འཁོར་ལོའི་ཆོ་ག་སྒྲུབ་པ་བཤད་པར་བགྱི་སྟེ།
en: I will now teach vidyā holders the ritual practice of the wheel noose, the nature of which allows them to enter passages to subterranean paradises.

source: རིག་སྔགས་འཆང་དེ་ཁོ་ན་ཉིད་བསྒྲུབས་པས་ཕུག་ཏུ་འཇུག་པའི་བསྒྲུབ་པ་ཐམས་ཅད་ཀྱི་མཆོག་ཕུག་ཏུ་འཇུག་པ་དང་།
en: This practice for entering all passages is the supreme means to this effect.

source: ལྷ་མ་ཡིན་གྱི་གནས་སུ་འཇུག་པ་དང་། མིའམ་ཅིའི་གནས་སུ་འཇུག་པ་དང་།
en: The vidyā holder will be able to enter the palaces of asuras, kinnaras, gandharvas, and devas.

source: དྲི་ཟའི་གནས་སུ་འཇུག་པ་དང་། ལྷའི་གནས་སུ་འཇུག་པ་དང་། ནམ་མཁའ་ལ་རྒྱུ་བ་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་གནས་སུ་འཇུག་པ་དང་། འོག་མིན་གྱི་གནས་ཀྱི་བར་དུ་འཇུག་པ་དང་།
en: He will be able to travel through space and enter the realm of Thirty-Three and even travel as far as the realm of Akaniṣṭha.

source: ཀླུའི་རྒྱལ་པོའི་གནས་སུ་འཇུག་པ་དང་། ཐང་ལ་རྒྱུ་བ་དང་། ཉི་མའི་གནས་སུ་འཇུག་པ་དང་། ཟླ་བའི་གནས་སུ་འཇུག་པ་དང་། སྐར་མ་དང་རྒྱུ་སྐར་གྱི་གནས་སུ་འཇུག་པ་དང་།
en: He will also gain entry to the palaces of the nāga kings and their subterranean realms, as well as the abodes of the sun, the moon, the stars, and the nakṣatras.

source: ནགས་སུ་འཇུག་པ་དང་། རིལ་རྒྱུ་བ་དང་། འབབ་ཆུ་ཆེན་པོར་འཇུག་པ་སྟེ། ཇི་ལྟ་ཇི་ལྟར་ཡིད་ལ་བསམས་པ་དེ་ལྟ་དེ་ལྟར་འཇིག་རྟེན་པ་དང་།
en: Whether it be forests, mountains, or great rivers, the vidyā holder will be able to enter any place he directs his thoughts, both in this world and beyond.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཞགས་པའི་ཆོ་ག་བསྒྲུབ་པ་ཚོགས་ཆུང་ངུ་དང་། རྩོལ་བ་ཆུང་ངུས་འགྲུབ་པར་འགྱུར་རོ།
en: The ritual procedure of the noose can accomplish this with little effort and little practice.

source: །དེལ་ཡིད་གཉིས་དང་། སོམ་ཉི་བསྐྱེད་པར་མི་བྱའོ།
en: He should not harbor any questions or doubts about this. “

source: །རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ། གོས་གཙང་མ་བགོས་ནས་ཟས་དཀར་གསུམ་འཚལ་བ།
en: The vidyā holder should be clean, bathe well, wear clean clothes, and live on the three ‘white’ foods.

source: གཙང་མ་དེ་ཁོ་ན་ཉིད་ལ་གུས་པས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བགྱིའོ། །བྱམས་པའི་སེམས་ལ་མཉམ་པར་གཞག་ནས་ས་སྙིང་རྗེའི་བསམ་པ་དག་པའི་ཡིད་ཀྱིས་ཚེས་བཅུ་གསུམ་ནས་བརྩམས་ཏེ།
en: He should chant the Buddhānusmṛti Gāthā in the true spirit of devotion and faith, cultivating thoughts of loving kindness, the heart of compassion, and a pure mind.

source: ཟླ་བ་ཉའི་བར་དུ་གསལ་བ་ཤིན་ཏུ་བཀྲ་ཤིས་པ་ལ་དུས་གསུམ་དུ་ཅི་འབྱོར་པའི་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མཆོད་པར་བགྱིས་ལ།
en: He should start on the thirteenth lunar day and follow the procedure until the full moon, as is auspicious.

source: རྟག་ཏུ་བརྒྱ་རྩ་བརྒྱད་པ་ཡི། །དུས་གསུམ་རྒྱུན་དུ་བཟླས་བརྗོད་བགྱི།
en: He should offer a pūjā according to his means three times a day and always recite the mantra one hundred and eight times, three times a day.

source: །ཉིན་པར་དུས་གསུམ་ལན་གསུམ་སྟེ། །མཚན་མོའི་དུས་སུ་ལན་གསུམ་བགྱི། །འཁོར་ལོ་ཞགས་པ་བླ་མེད་འདི།
en: He should do this at the three junctions of the day and the three junctions of the night. “

source: །སྐུད་པ་གསུམ་ལས་བསྒྲུབ་བགྱི་སྟེ། །རས་སྐུད་པདྨའི་སྐུད་པ་དང་། །ཨརྒའི་སྐུད་པ་སུམ་འགྱུར་དུ། །དེ་ནི་ལེགས་པར་ཚད་བཞིན་དུ།
en: He should procure three types of thread—cotton thread, lotus thread, and giant milkweed thread—and make the supreme wheel-noose.

source: །ཁྲུ་ནི་སུམ་ཅུ་རྩ་དྲུག་བགྱི།
en: He should twine them into a string with three strands exactly thirty-six cubits long.

source: །འཁོར་ལོ་རྣམ་པ་གསུམ་ལས་བགྱི། །རྒྱར་ནི་སོར་བཞིའི་ཚད་ལགས་ཏེ། །སྙིང་པོར་བཅས་ཤིང་མུ་ཁྱུད་བཅས།
en: He should also make a wheel four fingers in diameter with three parts—hub, rim, and spokes—distributed in a circle.

source: །ཀུན་ནས་རྩིབས་དང་ལྡན་པ་དག །གསེར་དང་དངུལ་དང་ཟངས་ལས་བགྱི།
en: The wheel should be made of gold, silver, and copper.

source: །ཆོས་བསྟན་ལེགས་པར་བརྒྱན་པ་ཡི། །བཟང་པོའི་སྟན་ལ་གཞག་པར་བགྱི།
en: He should place the wheel on a divine seat adorned as the Dharma seat.

source: །སྤོས་ཀྱི་དཀྱིལ་འཁོར་མེ་ཏོག་གི། །སིལ་མ་བཀྲམ་ནས་བུམ་པ་དགོད།
en: It should be strewn with the fragrant maṇḍūka flowers and adorned with full jars.

source: །དེ་བཞིན་མཆོད་ཡོན་སྣོད་ཀྱང་བཤམ།
en: The vidyā holder should also provide bowls with an argha offering, placing them opposite the cotton painting. “

source: །རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ཆོས་ཀྱི་སྟན་བཤམས་པར་བགྱིས་པའི་སྟེང་དུ་འཁོར་ལོའི་ཞགས་པ་གཞག་པར་བྱ་སྟེ། མཆོད་པ་བགྱིས་ལ་བསམས་པ་ཅི་ལྟ་བ་བཞིན་དུ་དུས་གསུམ་དུ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ།
en: He should then place the noose on the Dharma seat and, at the three junctions of the day, make offerings of whatever articles he chooses while reciting the mantra one hundred and eight times.

source: །དེ་ནས་ཚེས་བཅྭ་ལྔའི་ཟླ་བ་ཉ་བ་ལ་ཉིན་ཞག་གཅིག་མཆིས་པར་གྱུར་པས། ཚིག་གཞན་མི་སྨྲ་བར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རི་མོའི་གཟུགས་ལ་མཆོད་པ་བགྱི་ཞིང་།
en: Then, on the fifteenth lunar day when the moon is full, having fasted for one day and one night without speaking, he should make offerings to the cotton painting of Avalokiteśvara.

source: བདུག་པ་རྣམ་པ་གསུམ་པོ། །ཨ་ག་རུ་དང་། ཙན་དན་དང་། གུ་གུལ་རྣམས་འབུལ་བར་བགྱིའོ།
en: He should burn three types of incense—agarwood, sandalwood, and bdellium.

source: །རི་མོའི་གཟུགས་ཀྱི་མདུན་དུ་ཆོས་ཀྱི་སྟན་མཆིས་པ་ལ་མངོན་དུ་ཕྱོགས་ཏེ་མཆིས་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། ཡུངས་ཀར་རེ་རེ་ལ་བཟླས་བརྗོད་བགྱིས་པས་ཞགས་པའི་སྟེང་དུ་གཏོར་བར་བགྱིའོ།
en: Sitting opposite the painting in front of the Dharma seat, he should recite the heart mantra of Amoghapāśa one thousand and eight times, each time incanting a single mustard seed and casting it upon the noose. “

source: །སྟོང་རྩ་བརྒྱད་ཚང་ནས་ཞགས་པ་འབར་བའི་འཁོར་ལོ་ནམ་མཁའ་ལ་མཆིས་ནས་འབར་ཞིང་ལྡིང་བར་འགྱུར་རོ།
en: When he has reached the number one thousand and eight, the noose will blaze with light. The wheel will stay suspended in the air and revolve, ablaze with light.

source: །རིག་སྔགས་འཆང་གི་ལུས་ཀྱི་སྟོད་དང་། སྤྱི་བོ་ནས་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The body of the vidyā holder will radiate light, with rays emerging from his head.

source: །རི་མོའི་གཟུགས་ལས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པར་འགྱུར་རོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོའི་འཁོར་ལོ་ཞགས་པའི་ཆོ་ག་རྒྱ་ཆེན་པོ་འདི་འགྲུབ་པར་འཚལ་བར་བགྱིའོ།
en: Words of approval will then issue forth from the cotton painting, and the vidyā holder will know that he has accomplished the great rite of the wheel noose that employs the heart mantra of Amoghapāśa. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་མཆོད་པ་ཆེན་པོ་བགྱིས་ལ།
en: The vidyā holder should then offer a large pūjā and recite the mantra of Amogha­krodha­rāja.

source: དོན་ཡོད་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱི་སྟེ།
en: After incanting the noose one thousand and eight times, he should grasp it.

source: དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་ཞགས་པ་བླང་བར་བགྱིའོ། ལག་པ་གཡོན་པ་འཁོར་ལོའི་ཕྱག་རྒྱའི་ཚུལ་དུ་བཅིང་བར་བགྱི་ཞིང་།
en: With the left hand displaying the mudrā of the wheel he should grasp the wheel.

source: གཡས་པ་ཞགས་པའི་ཕྱག་རྒྱ་དང་འཁོར་ལོའི་ཚུལ་ལ་བརྟེན་ནས་བླངས་ཏེ།
en: With the right hand displaying the mudrā of the noose he should hold the noose.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བརྗོད་ནས་ཕྱོགས་བཞིར་འཕང་བར་བགྱིའོ།
en: He should then cast the noose in each of the four directions while reciting the heart mantra of Amoghapāśa.

source: །དེ་ནས་ཕྱོགས་བཅུར་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིའོ།
en: Afterward, he should cast the noose in the ten directions, each time reciting the mantra of Krodharāja twenty-one times.

source: །དེ་ནས་བདག་ཉིད་ཀྱི་ལུས་ལ་དབང་བསྐུར་བའི་ཚུལ་དུ་ལན་བདུན་དུ་བསྐོར་བར་བགྱིའོ།
en: He should then swing the noose seven times to consecrate his body.

source: །དེ་ནས་ཕྱག་རྒྱའི་ཚུལ་དུ་བསྐོར་བ་ཙམ་གྱི་མོད་ལ་རིག་སྔགས་འཆང་འཁོར་ལོས་སྒྱུར་བའི་དབང་བསྐུར་བར་འགྱུར་རོ།
en: He will be consecrated as the great emperor of the vidyādharas as soon as the noose is swung and the mudrā displayed. “

source: །དམ་པ་ཆེན་པོ་འགྲུབ་པར་འགྱུར་རོ།
en: Subsequently, he will obtain the supremely great accomplishments.

source: །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཆེན་པོ་ལེགས་མཐོང་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་ནས། རིག་སྔགས་འཆང་གི་རྐང་བ་སྤྱི་བོས་བླངས་ནས་འདི་སྐད་ཅེས་ཀྱང་སྨྲ་བར་འགྱུར་ཏེ།
en: The king Sudarśana with his great army will appear before him in person, bow his head to his feet, and say, ‘Speak, vidyā holder!

source: རིག་སྔགས་འཆང་གིས་ཅི་བཀའ་སྩལ་བ་དེ་བགྱིའོ་ཞེས་ཅི་བསྒོ་བའི་དོན་དེ་དང་དེ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: I will carry out whatever you command me to do.’ The vidyā holder should then specify what he needs, and Sudarśana will do it all.

source: །བྲན་ནི་རང་བཞིན་གྱིས་ཐམས་ཅད་དུ་ལས་བགྱིད་པར་འགྱུར་རོ།
en: He will become a servant who performs all the tasks. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གི་གནས་སུ་འཇུག་པར་འཚལ་བས། འདི་ལྟར་ནུབ་གསུམ་དུ་མཆིས་པར་གྱུར་པས། ཞགས་པའི་ཕྱག་རྒྱ་ལག་པས་བླང་བར་བགྱིའོ།
en: Whenever the vidyā holder wishes to enter a particular residence, he should fast for three days and nights and then display the noose mudrā with his hand.

source: །ཕུག་གི་སྒོ་གང་ལགས་པ་དེར་ཞགས་པ་ལན་གསུམ་དུ་བསྐོར་བར་བགྱིའོ། །དོན་ཡོད་པའི་རྒྱལ་པོ་བཟླས་བརྗོད་བགྱིས་ཏེ། ཞགས་པ་གདབ་པར་བགྱིའོ།
en: He should swing the noose three times in the direction of the entrance or opening, and cast it while reciting the Amogharāja.

source: །ཞགས་པ་བཏབ་པ་ཙམ་གྱི་མོད་ལ་གནས་ཀྱི་ཕུག་གི་སྒོ་ཐམས་ཅད་ཕྱེ་བར་འགྱུར་རོ། །འཁྲུལ་འཁོར་དང་། གཏན་པ་དང་། ཕུག་དང་། འབབ་ཆུ་ཆེན་པོ་དང་།
en: As soon as the noose is cast, the entrances or openings to any residence will open.
